Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAS176.atdf
         <register caption="" name="CNPDJ" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDJ0" />
            <bitfield mask="0x00000002" name="CNPDJ1" />
            <bitfield mask="0x00000004" name="CNPDJ2" />
            <bitfield mask="0x00000008" name="CNPDJ3" />
            <bitfield mask="0x00000010" name="CNPDJ4" />
            <bitfield mask="0x00000020" name="CNPDJ5" />
            <bitfield mask="0x00000040" name="CNPDJ6" />
            <bitfield mask="0x00000080" name="CNPDJ7" />
            <bitfield mask="0x00000100" name="CNPDJ8" />
            <bitfield mask="0x00000200" name="CNPDJ9" />
            <bitfield mask="0x00000400" name="CNPDJ10" />
            <bitfield mask="0x00000800" name="CNPDJ11" />
            <bitfield mask="0x00001000" name="CNPDJ12" />
            <bitfield mask="0x00002000" name="CNPDJ13" />
            <bitfield mask="0x00004000" name="CNPDJ14" />
            <bitfield mask="0x00008000" name="CNPDJ15" />
         </register>
         <register caption="" name="CNPDK" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDK0" />
            <bitfield mask="0x00000002" name="CNPDK1" />
            <bitfield mask="0x00000004" name="CNPDK2" />
            <bitfield mask="0x00000008" name="CNPDK3" />
            <bitfield mask="0x00000010" name="CNPDK4" />
            <bitfield mask="0x00000020" name="CNPDK5" />
            <bitfield mask="0x00000040" name="CNPDK6" />
            <bitfield mask="0x00000080" name="CNPDK7" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONE" offset="0x470" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONE__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONE__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONF" offset="0x570" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONF__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONG" offset="0x670" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONG__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONH" offset="0x770" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONH__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONH__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONJ" offset="0x870" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONJ__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONJ__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONK" offset="0x970" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONK__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONK__ON" />
         </register>
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEA0" />
            <bitfield mask="0x00000002" name="CNIEA1" />
            <bitfield mask="0x00000004" name="CNIEA2" />
            <bitfield mask="0x00000008" name="CNIEA3" />
            <bitfield mask="0x00000010" name="CNIEA4" />
            <bitfield mask="0x00000020" name="CNIEA5" />
            <bitfield mask="0x00000040" name="CNIEA6" />
            <bitfield mask="0x00000080" name="CNIEA7" />
            <bitfield mask="0x00000200" name="CNIEA9" />
            <bitfield mask="0x00000400" name="CNIEA10" />
            <bitfield mask="0x00004000" name="CNIEA14" />
            <bitfield mask="0x00008000" name="CNIEA15" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEB0" />
            <bitfield mask="0x00000002" name="CNIEB1" />
            <bitfield mask="0x00000004" name="CNIEB2" />
            <bitfield mask="0x00000008" name="CNIEB3" />
            <bitfield mask="0x00000010" name="CNIEB4" />
            <bitfield mask="0x00000020" name="CNIEB5" />
            <bitfield mask="0x00000040" name="CNIEB6" />
            <bitfield mask="0x00000080" name="CNIEB7" />
            <bitfield mask="0x00000100" name="CNIEB8" />
            <bitfield mask="0x00000200" name="CNIEB9" />
            <bitfield mask="0x00000400" name="CNIEB10" />
            <bitfield mask="0x00000800" name="CNIEB11" />
            <bitfield mask="0x00001000" name="CNIEB12" />
            <bitfield mask="0x00002000" name="CNIEB13" />
            <bitfield mask="0x00004000" name="CNIEB14" />
            <bitfield mask="0x00008000" name="CNIEB15" />
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000002" name="CNIEC1" />
            <bitfield mask="0x00000004" name="CNIEC2" />
            <bitfield mask="0x00000008" name="CNIEC3" />
            <bitfield mask="0x00000010" name="CNIEC4" />
            <bitfield mask="0x00001000" name="CNIEC12" />
            <bitfield mask="0x00002000" name="CNIEC13" />
            <bitfield mask="0x00004000" name="CNIEC14" />
            <bitfield mask="0x00008000" name="CNIEC15" />
         </register>
         <register caption="" name="CNEND" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIED0" />
            <bitfield mask="0x00000002" name="CNIED1" />
            <bitfield mask="0x00000004" name="CNIED2" />
            <bitfield mask="0x00000008" name="CNIED3" />
            <bitfield mask="0x00000010" name="CNIED4" />
            <bitfield mask="0x00000020" name="CNIED5" />
            <bitfield mask="0x00000040" name="CNIED6" />
            <bitfield mask="0x00000080" name="CNIED7" />
            <bitfield mask="0x00000200" name="CNIED9" />
            <bitfield mask="0x00000400" name="CNIED10" />
            <bitfield mask="0x00000800" name="CNIED11" />
            <bitfield mask="0x00001000" name="CNIED12" />
            <bitfield mask="0x00002000" name="CNIED13" />
            <bitfield mask="0x00004000" name="CNIED14" />
            <bitfield mask="0x00008000" name="CNIED15" />
         </register>
         <register caption="" name="CNENE" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEE0" />
            <bitfield mask="0x00000002" name="CNIEE1" />
            <bitfield mask="0x00000004" name="CNIEE2" />
            <bitfield mask="0x00000008" name="CNIEE3" />
            <bitfield mask="0x00000010" name="CNIEE4" />
            <bitfield mask="0x00000020" name="CNIEE5" />
            <bitfield mask="0x00000040" name="CNIEE6" />
            <bitfield mask="0x00000080" name="CNIEE7" />
            <bitfield mask="0x00000100" name="CNIEE8" />
            <bitfield mask="0x00000200" name="CNIEE9" />
         </register>
         <register caption="" name="CNENF" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEF0" />
            <bitfield mask="0x00000002" name="CNIEF1" />
            <bitfield mask="0x00000004" name="CNIEF2" />
            <bitfield mask="0x00000008" name="CNIEF3" />
            <bitfield mask="0x00000010" name="CNIEF4" />
            <bitfield mask="0x00000020" name="CNIEF5" />
            <bitfield mask="0x00000100" name="CNIEF8" />
            <bitfield mask="0x00001000" name="CNIEF12" />
            <bitfield mask="0x00002000" name="CNIEF13" />
         </register>
         <register caption="" name="CNENG" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEG0" />
            <bitfield mask="0x00000002" name="CNIEG1" />
            <bitfield mask="0x00000040" name="CNIEG6" />
            <bitfield mask="0x00000080" name="CNIEG7" />
            <bitfield mask="0x00000100" name="CNIEG8" />
            <bitfield mask="0x00000200" name="CNIEG9" />
            <bitfield mask="0x00001000" name="CNIEG12" />
            <bitfield mask="0x00002000" name="CNIEG13" />
            <bitfield mask="0x00004000" name="CNIEG14" />
            <bitfield mask="0x00008000" name="CNIEG15" />
         </register>
         <register caption="" name="CNENH" offset="0x780" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEH0" />
            <bitfield mask="0x00000002" name="CNIEH1" />
            <bitfield mask="0x00000004" name="CNIEH2" />
            <bitfield mask="0x00000008" name="CNIEH3" />
            <bitfield mask="0x00000010" name="CNIEH4" />
            <bitfield mask="0x00000020" name="CNIEH5" />
            <bitfield mask="0x00000040" name="CNIEH6" />
            <bitfield mask="0x00000080" name="CNIEH7" />
            <bitfield mask="0x00000100" name="CNIEH8" />
            <bitfield mask="0x00000200" name="CNIEH9" />
            <bitfield mask="0x00000400" name="CNIEH10" />
            <bitfield mask="0x00000800" name="CNIEH11" />
            <bitfield mask="0x00001000" name="CNIEH12" />
            <bitfield mask="0x00002000" name="CNIEH13" />
            <bitfield mask="0x00004000" name="CNIEH14" />
            <bitfield mask="0x00008000" name="CNIEH15" />
         </register>
